Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.КпкЗаявка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUI_77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналСбытаФайно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КД_КаналыСбыта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентУвеличенияПрогнозаСреднихПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераПачек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодАнализаДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодАнализаДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланированияДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланированияДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзменено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АнализПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КаналСбыта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_КаналыСбыта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСтандартаПрисутствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_ТипыСтандартовПрисутствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн1</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн2</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн3</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн4</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн5</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн6</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн7</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрогнозПродажНаДатуПоставки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрогнозПродажДоКонцаПериодаПланирования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн1_Дефицит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн2_Дефицит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн3_Дефицит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн4_Дефицит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн5_Дефицит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн6_Дефицит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дн7_Дефицит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьПланирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КаналСбыта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_КаналыСбыта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Планирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КаналСбыта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_КаналыСбыта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНаДатуЗаказа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрогнозПродажНаДатуПоставки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПрогнозНаДатуПоставки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрогнозПродажДоКонцаПериодаПланирования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйЗаказ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КоэффициентыУвеличенияПрогнозаСреднихПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПродукта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_ГруппыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КаналСбыта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_КаналыСбыта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказПоставщику/Ext/ManagerModule.bsl
#Область изменения_20190305_Карпачев_А_Ю

Процедура ВывестиШапкуЭлементаМассиваОбъектов(табличныйДокумент, номерСтрокиНачало, элементМассиваОбъектов)
	
	шрифтШапки = Новый Шрифт("Arial", 11, Истина, , , , );
	
	ячейкаЗаказПоставщику		 = табличныйДокумент.Область("R" + Строка(номерСтрокиНачало + 1) + "C1");
	ячейкаЗаказПоставщику.Текст	 = "Заказ поставщику " + элементМассиваОбъектов.Номер + " от " + Формат(элементМассиваОбъектов.Дата, "ДЛФ=Д") + "г.";
	ячейкаЗаказПоставщику.Шрифт	 = шрифтШапки;
	
	ячейкаПоставщик			 = табличныйДокумент.Область("R" + Строка(номерСтрокиНачало + 2) + "C1");
	ячейкаПоставщик.Текст	 = "Поставщик: " + элементМассиваОбъектов.Контрагент;
	ячейкаПоставщик.Шрифт	 = шрифтШапки;
	
	ячейкаПериодПланирования		 = табличныйДокумент.Область("R" + Строка(номерСтрокиНачало + 3) + "C1");
	ячейкаПериодПланирования.Текст	 = "Период планирования: " + Формат(элементМассиваОбъектов.ПериодПланированияДатаНачала, "ДЛФ=Д") + "-" +Формат(элементМассиваОбъектов.ПериодПланированияДатаОкончания, "ДЛФ=Д"); 
	ячейкаПериодПланирования.Шрифт	 = шрифтШапки;
	
	ячейкаПробел		 = табличныйДокумент.Область("R" + Строка(номерСтрокиНачало + 4) + "C1");
	ячейкаПробел.Текст	 = "";
	
КонецПроцедуры

Функция АнализПланирования(массивОбъектов, объектыПечати, имяМакета, коллекцияПечатныхФорм)
	
	табличныйДокумент = Новый ТабличныйДокумент;
	
	табличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЗаказПоставщику";
	
	первыйДокумент = Истина;
	
	Для Каждого элементМассиваОбъектов Из массивОбъектов Цикл
		
		Если Не первыйДокумент Тогда
			табличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		первыйДокумент = Ложь;
		
		номерСтрокиНачало = табличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиШапкуЭлементаМассиваОбъектов(табличныйДокумент, номерСтрокиНачало, элементМассиваОбъектов);
		
		схемаКомпоновкиДанных = ПолучитьМакет("АнализПланирования");
		
		компоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных();
		
		компоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(схемаКомпоновкиДанных));
		
		компоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(схемаКомпоновкиДанных.НастройкиПоУмолчанию);
		
		настройки = компоновщикНастроекКомпоновкиДанных.Настройки;
		
		настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЗаказПоставщикуСсылка", элементМассиваОбъектов);
		настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подразделение", элементМассиваОбъектов.Подразделение);
		настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодПланирования", Новый СтандартныйПериод(элементМассиваОбъектов.ПериодПланированияДатаНачала, КонецДня(элементМассиваОбъектов.ПериодПланированияДатаОкончания)));
		
		компоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		макетКомпоновкиДанных = компоновщикМакетаКомпоновкиДанных.Выполнить(схемаКомпоновкиДанных, настройки);
		
		процессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		
		процессорКомпоновкиДанных.Инициализировать(макетКомпоновкиДанных);
		
		процессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		
		процессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(табличныйДокумент);
		
		процессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(процессорКомпоновкиДанных);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(табличныйДокумент, номерСтрокиНачало, объектыПечати, элементМассиваОбъектов);
		
	КонецЦикла;
	
	табличныйДокумент.ФиксацияСверху = 0;
	табличныйДокумент.АвтоМасштаб	 = Истина;
	
	Возврат табличныйДокумент;
	
КонецФункции

#КонецОбласти

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БМК") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БМК", "Заказ поставщику", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БМК"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БМК_ОднаКолонка") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БМК_ОднаКолонка", "Заказ поставщику", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БМК_ОднаКолонка"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БМК_ОднаКолонка_СКодом") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БМК_ОднаКолонка_СКодом", "Заказ поставщику", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БМК_ОднаКолонка_СКодом"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БМК2017") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БМК2017", "Заказ  поставщику", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БМК2017"));
		
		#Область изменения_20190305_Карпачев_А_Ю
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(коллекцияПечатныхФорм, "АнализПланирования") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(коллекцияПечатныхФорм, "АнализПланирования", "Анализ планирования", АнализПланирования(массивОбъектов, объектыПечати, "АнализПланирования", коллекцияПечатныхФорм));
		#КонецОбласти
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЗаказПоставщику";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "БМК" Тогда
			
			запрос = Новый Запрос;
			
			#Область ТекстЗапроса
			
			запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
			|	СУММА(ЗаказПоставщикуЗапасы.Количество) КАК Количество,
			|	ЗаказПоставщикуЗапасы.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры
			|ИЗ
			|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
			|ГДЕ
			|	ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказПоставщикуЗапасы.Номенклатура.ВидНоменклатуры,
			|	ЗаказПоставщикуЗапасы.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказПоставщикуЗапасы.Номенклатура.Наименование
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	НоменклатураВидНоменклатуры";
			
			#КонецОбласти 
			
			запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
			
			ТаблицаСостава = Новый ТаблицаЗначений;
			ТаблицаСостава.Колонки.Добавить("Раздел");
			ТаблицаСостава.Колонки.Добавить("Номенклатура1");
			ТаблицаСостава.Колонки.Добавить("Количество1");
			ТаблицаСостава.Колонки.Добавить("Номенклатура2");
			ТаблицаСостава.Колонки.Добавить("Количество2");
			
			ИтКоличество = 0;
			
			ВыборкаВидНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураВидНоменклатуры");
			Пока ВыборкаВидНоменклатуры.Следующий() Цикл
				
				НомСтр = 0;
				
				Выборка = ВыборкаВидНоменклатуры.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					НомСтр = НомСтр + 1;
					
					ИтКоличество = ИтКоличество + Выборка.Количество;
					
					Если НЕ(НомСтр/2 = Цел(НомСтр/2)) Тогда
						
						НоваяСтрока = ТаблицаСостава.Добавить();
						НоваяСтрока.Раздел = Выборка.НоменклатураВидНоменклатуры;
						НоваяСтрока.Номенклатура1 = Выборка.Номенклатура;
						НоваяСтрока.Количество1 = Выборка.Количество;
					Иначе
						НоваяСтрока.Номенклатура2 = Выборка.Номенклатура;
						НоваяСтрока.Количество2 = Выборка.Количество;
						
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			
			// Заполним набор данных....
			ВнешниеНаборыДанных = Новый Структура("Состав", ТаблицаСостава );
			
			СхемаКомпоновкиДанных = ПолучитьМакет("БМК");
			
			СхемаКомпоновкиДанных.Параметры[0].Значение = ТекущийДокумент.НомерЗаказа.Представление;
			СхемаКомпоновкиДанных.Параметры[1].Значение = ТекущийДокумент.Контрагент;
			СхемаКомпоновкиДанных.Параметры[2].Значение = НачалоДня(ТекущийДокумент.ДатаДоставки) - 24*60*60;
			СхемаКомпоновкиДанных.Параметры[3].Значение = ИтКоличество;
			
			
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
			
			ПроцессорКомпоновкиДанных = Новый процессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
			
			
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			
			ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
			процессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
			
			ТабличныйДокумент.ОтображатьСетку = Ложь;
			ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
			
		ИначеЕсли Лев(ИмяМакета, 15) = "БМК_ОднаКолонка" Тогда
			
			запрос = Новый Запрос;
			
			#Область ТекстЗапроса
			
			запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
			|	СУММА(ЗаказПоставщикуЗапасы.Количество) КАК Количество,
			|	ЗаказПоставщикуЗапасы.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры
			|ИЗ
			|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
			|ГДЕ
			|	ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказПоставщикуЗапасы.Номенклатура.ВидНоменклатуры,
			|	ЗаказПоставщикуЗапасы.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказПоставщикуЗапасы.Номенклатура.Наименование
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	НоменклатураВидНоменклатуры";
			
			#КонецОбласти 
			
			запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
			
			ТаблицаСостава = Новый ТаблицаЗначений;
			ТаблицаСостава.Колонки.Добавить("Раздел");
			ТаблицаСостава.Колонки.Добавить("Номенклатура1");
			ТаблицаСостава.Колонки.Добавить("Ед1");
			ТаблицаСостава.Колонки.Добавить("Количество1");
			
			
			ИтКоличество = 0;
			
			ВыборкаВидНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураВидНоменклатуры");
			Пока ВыборкаВидНоменклатуры.Следующий() Цикл
				
				НомСтр = 0;
				
				Выборка = ВыборкаВидНоменклатуры.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					НомСтр = НомСтр + 1;
					
					ИтКоличество = ИтКоличество + Выборка.Количество;
					
					НоваяСтрока = ТаблицаСостава.Добавить();
					НоваяСтрока.Раздел = Выборка.НоменклатураВидНоменклатуры;
					НоваяСтрока.Номенклатура1 = Выборка.Номенклатура;
					НоваяСтрока.Ед1 = Выборка.Номенклатура.ЕдиницаИзмерения;
					НоваяСтрока.Количество1 = Выборка.Количество;
					
				КонецЦикла;
				
			КонецЦикла;
			
			
			// Заполним набор данных....
			ВнешниеНаборыДанных = Новый Структура("Состав", ТаблицаСостава );
			
			СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
			
			СхемаКомпоновкиДанных.Параметры[0].Значение = ТекущийДокумент.НомерЗаказа.Представление;
			СхемаКомпоновкиДанных.Параметры[1].Значение = ТекущийДокумент.Контрагент;
			СхемаКомпоновкиДанных.Параметры[3].Значение = ИтКоличество;
			
			Если ИмяМакета = "БМК_ОднаКолонка" Тогда
				СхемаКомпоновкиДанных.Параметры[2].Значение = НачалоДня(ТекущийДокумент.ДатаДоставки); // - 24*60*60;
			Иначе
				СхемаКомпоновкиДанных.Параметры[2].Значение = НачалоДня(ТекущийДокумент.ДатаДоставки) - 24*60*60;
			КонецЕсли;
			
			
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
			
			ПроцессорКомпоновкиДанных = Новый процессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
			
			
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			
			ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
			процессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
			
			ТабличныйДокумент.ОтображатьСетку = Ложь;
			ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
			ТабличныйДокумент.ПолеСлева = 0;
			ТабличныйДокумент.ПолеСправа = 0;
			ТабличныйДокумент.ПолеСверху = 0;
			ТабличныйДокумент.ПолеСнизу = 0;
			
		ИначеЕсли ИмяМакета = "БМК2017" Тогда
			
			запрос = Новый Запрос;
			
			#Область ТекстЗапроса
			
			запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
			|	СУММА(ЗаказПоставщикуЗапасы.Количество) КАК Количество,
			|	ЗаказПоставщикуЗапасы.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры
			|ИЗ
			|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
			|ГДЕ
			|	ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказПоставщикуЗапасы.Номенклатура.ВидНоменклатуры,
			|	ЗаказПоставщикуЗапасы.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказПоставщикуЗапасы.Номенклатура.Наименование
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	НоменклатураВидНоменклатуры";
			
			#КонецОбласти 
			
			запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
			
			ТаблицаСостава = Новый ТаблицаЗначений;
			ТаблицаСостава.Колонки.Добавить("Раздел");
			ТаблицаСостава.Колонки.Добавить("Номенклатура1");
			ТаблицаСостава.Колонки.Добавить("Ед1");
			ТаблицаСостава.Колонки.Добавить("Количество1");
			
			
			ИтКоличество = 0; 
			
			ВыборкаВидНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураВидНоменклатуры");
			Пока ВыборкаВидНоменклатуры.Следующий() Цикл
				
				НомСтр = 0;
				
				Выборка = ВыборкаВидНоменклатуры.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					НомСтр = НомСтр + 1;
					
					ИтКоличество = ИтКоличество + Выборка.Количество;
					
					
					НоваяСтрока = ТаблицаСостава.Добавить();
					НоваяСтрока.Раздел = Выборка.НоменклатураВидНоменклатуры;
					НоваяСтрока.Номенклатура1 = Выборка.Номенклатура;
					НоваяСтрока.Ед1 = Выборка.Номенклатура.ЕдиницаИзмерения;
					НоваяСтрока.Количество1 = Выборка.Количество;
					
				КонецЦикла;
				
			КонецЦикла;
			
			
			// Заполним набор данных....
			ВнешниеНаборыДанных = Новый Структура("Состав", ТаблицаСостава );
			
			СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
			
			СхемаКомпоновкиДанных.Параметры[0].Значение = ТекущийДокумент.НомерЗаказа.Представление;
			СхемаКомпоновкиДанных.Параметры[1].Значение = ТекущийДокумент.Контрагент;
			СхемаКомпоновкиДанных.Параметры[2].Значение = НачалоДня(ТекущийДокумент.ДатаДоставки);
			СхемаКомпоновкиДанных.Параметры[3].Значение = ИтКоличество;
			СхемаКомпоновкиДанных.Параметры[4].Значение = ТекущийДокумент.Контрагент.ОКПО;
			СхемаКомпоновкиДанных.Параметры[5].Значение = ТекущийДокумент.НомерЗаказа.КодПачкиПоставщика;
			СхемаКомпоновкиДанных.Параметры[6].Значение = НачалоДня(ТекущийДокумент.Дата);
			
			
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
			
			ПроцессорКомпоновкиДанных = Новый процессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
			
			
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			
			ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
			процессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
			
			ТабличныйДокумент.ОтображатьСетку = Ложь;
			ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
			ТабличныйДокумент.ПолеСлева = 0;
			ТабличныйДокумент.ПолеСправа = 0;
			ТабличныйДокумент.ПолеСверху = 0;
			ТабличныйДокумент.ПолеСнизу = 0;
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()
